
Practical 6: Static VLANs, VLAN Trunking, and VTP Domains and Modes

Step 1: Configure basic switch parameters.
Switch# configure terminal
Switch(config)# hostname DLS1
DLS1(config)# interface vlan 1
DLS1(config-if)# ip address 10.1.1.101 255.255.255.0
DLS1(config-if)# no shutdown

Switch# configure terminal
Switch(config)# hostname DLS2
DLS2(config)# interface vlan 1
DLS2(config-if)# ip address 10.1.1.102 255.255.255.0
DLS2(config-if)# no shutdown

Switch# configure terminal
Switch(config)# hostname ALS1
ALS1(config)# interface vlan 1
ALS1(config-if)# ip address 10.1.1.103 255.255.255.0
ALS1(config-if)# no shutdown

Switch# configure terminal
Switch(config)# hostname ALS2
ALS2(config)# interface vlan 1
ALS2(config-if)# ip address 10.1.1.104 255.255.255.0
ALS2(config-if)# no shutdown

Step 2: Display the switch default VLAN information.
ALS1# show vlan

Step 3: Examine VTP information.
DLS1# show vtp status
VTP Version: running VTP1 (VTP2 capable)
Configuration Revision: 70
Maximum VLANs supported locally: 1005
Number of existing VLANs: 5
VTP Operating Mode: Server

Step 4: Configure VTP on the switches.
DLS1(config)# vtp domain SWLAB
Changing VTP domain name from NULL to SWLAB
DLS1(config)# vtp version 2
DLS1(config)# vtp mode server
Device mode already VTP SERVER.

ALS1(config)# vtp mode client
Setting device to VTP CLIENT mode.
ALS1# show vtp status
VTP Version: running VTP1 (VTP2 capable)
VTP Operating Mode: Client

Step 5: Configure trunking.
ALS1# show interfaces fastEthernet 0/7 switchport
Name: Fa0/7
Switchport: Enabled
Administrative Mode: dynamic auto

DLS1(config)# interface range fastEthernet 0/7 - 10
DLS1(config-if-range)# switchport trunk encapsulation dot1q
DLS1(config-if-range)# switchport mode trunk

DLS1(config)# interface range fastEthernet 0/11 - 12
DLS1(config-if-range)# switchport trunk encapsulation dot1q
DLS1(config-if-range)# switchport mode trunk

ALS1(config)# interface range fastEthernet 0/7 - 12
ALS1(config-if-range)# switchport mode trunk

ALS2(config)# interface range fastEthernet 0/7 - 12
ALS2(config-if-range)# switchport mode trunk

DLS2(config)# interface range fastEthernet 0/7 - 8
DLS2(config-if-range)# switchport trunk encapsulation dot1q
DLS2(config-if-range)# switchport mode trunk

Step 6: Verify trunk configuration.
ALS2# show interfaces fastEthernet 0/7 switchport
Name: Fa0/7
Trunking Native Mode VLAN: 1 (default)
Operational private-vlan: none
Trunking VLANs Enabled: ALL

DLS1, DLS2, ALS1, ALS2# show interfaces trunk
Port        Mode        Encapsulation  Status
Fa0/7      on          802.1q trunking 1
Fa0/8      on          802.1q trunking 1
Fa0/9      on          802.1q trunking 1
Fa0/10     on          802.1q trunking 1

Step 7: Configure access ports.
ALS1(config)# interface fastEthernet 0/6
ALS1(config-if)# switchport mode ?
ALS1(config)# interface fastEthernet 0/6
ALS1(config-if)# switchport mode access
ALS1# show interfaces fastEthernet 0/6 switchport
Name: Fa0/6
Switchport: Enabled
Administrative Mode: static access
Negotiation of Trunking: Off

Step 8: Verify VTP configuration.
ALS1# show vtp status
VTP Version: running VTP2
ALS2# show vtp status

Step 9: Configure VLANs by assigning port membership.
DLS1(config)# interface FastEthernet 0/6
DLS1(config-if)# switchport access vlan 100
DLS2(config)# interface FastEthernet 0/6
DLS2(config-if)# switchport access vlan 110
96 Access VLAN does not exist. Creating VLAN 110.

DLS1# show vlan
100 VLAN100 active Fa0/6
110 VLAN110 active 1002 fddi-default

Step 10: Configure VLANs in configuration mode.
DLS1(config)# vlan 120
ALS1(config)# interface fastEthernet 0/6
ALS1(config-if)# switchport access vlan 120
ALS2(config)# interface fastEthernet 0/6
ALS2(config-if)# switchport access vlan 120
ALS1# show vlan

Step 11: Change the VLAN names.
DLS1(config)# vlan 100
DLS1(config-vlan)# name Server-Farm-1
DLS1(config-vlan)# exit

DLS1(config)# vlan 110
DLS1(config-vlan)# name Server-Farm-2
DLS1(config-vlan)# exit

DLS1(config)# vlan 120
DLS1(config-vlan)# name Net-Eng
DLS1(config-vlan)# exit

DLS1# show vlan
Gi0/2 100 Server-Farm-1 active Fa0/6
110 Server-Farm-2 active 
120 Net-Eng active 
1002 fddi-default act/unsup 
1003 token-ring-default act/unsup 
1004 fddi-net-default act/unsup 
1005 trnet-default act/unsup